package soobin.assign.chap03.exam01;

public class Task03 {

	public static void main(String[] args) {

		//1. for문을 사용해 1~100까지 자연수 중 짝수 만 출력하기
		//힌트) %연산자를 사용하면 홀수, 짝수 판별이 가능합니다.
		
		
		
		
		//2. 1번 문제를 %연산자를 사용하지 않고 출력해봅시다.
		//힌트) for(초기값; 조건문; 증가값)중 어떤 값을 바꿔야 할 지 잘 생각해봅시다.
		
		
		
		//3. for문을 이용해 100->0 까지 큰수에서 작은수로 출력되도록 만들어봅시다.
		//힌트) 2번 문제를 해결하셨다면 충분히 하실 수 있습니다:)
		
		
		
		//4. while문을 사용해 1~100까지 자연수 중 3의 배수의 합 구하기
		//힌트) %연산자 사용하여 3의 배수 찾기
		
		int sum = 0;
		
		//코드 작성
		
		System.out.println(sum);
		
		
		
		//5. 아래 그림과 같은 역삼각형을 출력해보자
		/*
		 
		  *******
		   ***** 
		    ***
		     *
		     
		*/
		
		
		
		//6. 나이가 19세 이하이거나 60세 이상이면 할인해주려고 합니다. 
		//   int age 값을 새로 초기화하여 검사할 때 할인 대상인지 아닌지 판별해봅시다.
		//   아래 코드의 주석을 해제하고 () 안을 채워서 실행해보면 됩니다.
		
		
		int age = 19;
//		
//		if() {
//			System.out.println("할인 대상 O");
//		} else if () {
//			System.out.println("할인 대상 O)");				
//		} else {
//			System.out.println("할인 대상 X");
//		}
		
		
		
		//7. if문을 사용하여 사용자가 정수를 입력하였을 때 그 값이 100보다 작은지 같은지 큰지를 판별해보자.
		//힌트) if - else if - else 문법을 사용
		
		int numIf = 10;
		
		
	
		//8. 7번 문제를 switch문으로 바꿔보자
		
		int numSwitch = 110;
		
		
	}

}
